<a href="https://colab.research.google.com/github/Natasha-de/Project/blob/main/Projectpynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

# data import

In [4]:
data =  pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data",header = None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [8]:
names =["Id","RI","Na","Mg","Al","Si","K","Ca","Ba","Fe","Class"]
data.columns=names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [12]:
data['Class'].replace(
                      {
                       1:"building_windows_float",
                       2:"building_windows_non_float",
                       3:"vehicle_windows_float",
                       4:"vehicle_windows_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps",
                      },inplace=True)
data.head(3)

        RI     Na    Mg    Al  ...    Ca   Ba   Fe                             Class
0  1.52101  13.64  4.49  1.10  ...  8.75  0.0  0.0  building_windows_float_processed
1  1.51761  13.89  3.60  1.36  ...  7.83  0.0  0.0  building_windows_float_processed
2  1.51618  13.53  3.55  1.54  ...  7.78  0.0  0.0  building_windows_float_processed

[3 rows x 10 columns]

In [20]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col]=np.nan
data.head(10)

        RI     Na    Mg  ...   Ba    Fe                             Class
0  1.52101  13.64   NaN  ...  NaN   NaN  building_windows_float_processed
1      NaN  13.89   NaN  ...  NaN   NaN                               NaN
2      NaN    NaN   NaN  ...  0.0   NaN                               NaN
3  1.51766  13.21  3.69  ...  NaN  0.00  building_windows_float_processed
4      NaN    NaN  3.62  ...  NaN  0.00  building_windows_float_processed
5      NaN    NaN   NaN  ...  0.0  0.26  building_windows_float_processed
6  1.51743  13.30  3.60  ...  0.0  0.00  building_windows_float_processed
7  1.51756  13.15  3.61  ...  0.0   NaN  building_windows_float_processed
8  1.51918  14.04   NaN  ...  NaN  0.00  building_windows_float_processed
9  1.51755  13.00   NaN  ...  0.0  0.11  building_windows_float_processed

[10 rows x 10 columns]

# Data vizualization

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      133 non-null    float64
 1   Na      144 non-null    float64
 2   Mg      134 non-null    float64
 3   Al      141 non-null    float64
 4   Si      145 non-null    float64
 5   K       134 non-null    float64
 6   Ca      131 non-null    float64
 7   Ba      138 non-null    float64
 8   Fe      134 non-null    float64
 9   Class   136 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [22]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  133.000000  144.000000  134.000000  ...  131.000000  138.000000  134.000000
mean     1.518252   13.381111    2.697313  ...    9.039847    0.162464    0.062836
std      0.003194    0.823956    1.460406  ...    1.409361    0.504075    0.098214
min      1.511310   10.730000    0.000000  ...    5.870000    0.000000    0.000000
25%      1.516400   12.930000    2.212500  ...    8.280000    0.000000    0.000000
50%      1.517660   13.295000    3.480000  ...    8.590000    0.000000    0.000000
75%      1.519050   13.875000    3.617500  ...    9.360000    0.000000    0.110000
max      1.533930   17.380000    3.980000  ...   16.190000    3.150000    0.370000

[8 rows x 9 columns]

In [23]:
display(data['Class'].describe())
print("===================================")
display(data['Class'].value_counts())

count                                      136
unique                                       6
top       building_windows_non_float_processed
freq                                        49
Name: Class, dtype: object

===================================

building_windows_non_float_processed    49
building_windows_float_processed        48
headlamps                               17
vehicle_windows_float_processed         11
containers                               6
tableware                                5
Name: Class, dtype: int64